#include <stdio.h>

void main()
{
	int x,w,a,b,c,d,e;//依次定义 输入值 位数 个位 十位 百位 千位 万位
	printf("请输入一个不多于五位的正整数\n");
	scanf("%d",&x);

	if(10000<=x&&x<=99999)//五位数情况
	{
		w=5;
		
		a=x%10;
		b=(x%100-a)/10;
		c=(x%1000-b*10-a)/100;
		d=(x%10000-c*100-b*10-a)/1000;
		e=(x-d*1000-c*100-b*10-a)/10000;

		printf("从万位到个位，五个数字依次为%d %d %d %d %d\n",e,d,c,b,a);
		printf("逆序输出该数值为%d%d%d%d%d\n",a,b,c,d,e);
	}
	else if(1000<=x&&x<=9999)//四位数情况
	{
		w=4;

		a=x%10;
		b=(x%100-a)/10;
		c=(x%1000-b*10-a)/100;
		d=(x-c*100-b*10-a)/1000;

		printf("从千位到个位，四个数字依次为%d %d %d %d\n",d,c,b,a);
		printf("逆序输出该数值为%d%d%d%d\n",a,b,c,d);
	}
	else if(100<=x&&x<=999)//三位数情况
	{
		w=3;

		a=x%10;
		b=(x%100-a)/10;
		c=(x-b*10-a)/100;

		printf("从百位到个位，四个数字依次为%d %d %d\n",c,b,a);
		printf("逆序输出该数值为&d&d&d\n",a,b,c);
	}
	else if(10<=x&&x<=99)//两位数情况
	{
		w=2;
		
		a=x%10;
		b=(x-a)/10;

		printf("从十位到个位，两个数字依次为%d %d\n",b,a);
		printf("逆序输出该数值为%d%d\n",a,b);
	}
	else if(1<=x&&x<=9)//个位数情况
	{
		w=1;

		printf("该数字仅一位，为%d\n",x);
		printf("逆序输出该数值仍为%d\n",x);
	}
	else//错误情况，增加提示，使程序更人性化
	{
		printf("抱歉！\n您输入的数字不符合‘不超过五位的正整数’的条件，程序将报错\n请检查后重试\n");
	}

	printf("这是一个%d位数\n",w);
}