/*******************************************
	1427405017
	沈家赟
	E17
	2014-10-29 22:36:00
*******************************************/
#include <stdio.h>

void main()
{
	int a,b,c,m;		//依次定义1元a、2元b、5元c，总金额m
	printf("循环程序计算中，可能需要等待数秒...\n");		//让程序更友好

	for(a=0;a<=50;a++)		//外层循环1元，最多50个
	{
		for(b=0;b<=25;b++)		//中层循环2元，最多25个
		{
			for(c=0;c<=10;c++)		//内层循环5元，最多10个
			{
				m=a+2*b+5*c;		//求总金额

				if(m==50)		//每次内层完成计算后，进行判断，输出符合条件的解
				{
					printf("1元钱币%d个	2元钱币%d个	5元钱币%d个\n",a,b,c);
				}
			}
		}
	}
}