/*******************************************
	1427405017
	沈家赟
	E19
	2014-10-29 22:37:00
*******************************************/
#include <stdio.h>

void main()
{
	int a,b,c,m,n;	//分别定义鸡翁数a，鸡母数b，3鸡雏组数c（为避免非整数，每组设置3个鸡雏），钱m，总鸡数n
	printf("循环程序计算中，可能需要等待数秒...\n");	//让程序更友好

	for(a=0;a<=20;a++)	//外层循环鸡翁，受制于百钱，鸡翁最多20个
	{
		for(b=0;b<=33;b++)	//中层循环鸡母，受制于百钱，鸡母最多33个
		{
			for(c=0;c<=33;c++)	//内层循环3鸡雏组，受制于百鸡，3鸡雏最多33组
			{
				m=5*a+3*b+c;	//求总金额
				n=a+b+3*c;	//求总鸡数（鸡雏组数还要乘3）

				if(m==100&&n==100)	//内层每次循环后，判断是否符合“百钱百鸡”条件，并输出解
				{
					printf("鸡翁%d个 鸡母%d个 鸡雏%d个\n",a,b,3*c);
				}
			}
		}
	}
}