/*****************
	1427405017
	沈家赟
	E24
	2014-11-7 20:57
*****************/
#include <stdio.h>

void main()
{
	int x[8][8],i,j;		//定义八行八列数组x，行标i，列标j

	for(i=0;i<8;i++)		//外层循环i
	{
		for(j=0;j<=i;j++)	//内层循环j
		{
			if(j==0||i==j)	//第一列,对角线上均为1
			{
				x[i][j]=1;
			}
			else			//其他数值
			{
				x[i][j]=x[i-1][j-1]+x[i-1][j];
			}
		}
	}

	printf("下面将显示8行的杨辉三角形：\n");	//结果输出语句块
	for(i=0;i<8;i++)				//外层循环行
	{
		for(j=0;j<=i;j++)			//内层循环列
		{
			printf("%5d",x[i][j]);	//显示，限制格式使结果更美观
		}
		printf("\n");
	}
}