/*********************
	1427405017
	沈家赟
	E29
	2014-11-12 10:29
*********************/
#include <stdio.h>
#include <string.h>

void main()
{
	char x[100];
	int i;

	printf("请输入一个英文句子（以空格、逗号、分号、句号为分隔符）：\n");
	gets(x);
	
	printf("\n单词分割结果如下：\n");
	for(i=0;i<100;i++)
	{
		if(x[i]==' '||x[i]==','||x[i]==';'||x[i]=='.')		//语句中出现分隔符
		{
			if((x[i+1]>='A'&&x[i+1]<='Z')||(x[i+1]>='a'&&x[i+1]<='z'))	//若下一项为字母，则换行
			{
				printf("\n");
			}
		}
		else
		{
			if(x[i]!='\0')									//语句未结束时，显示单词字母
			{
				printf("%c",x[i]);
			}
			else											//语句结束，出现\0时，就结束循环
			{
				printf("\n");								//结束前换次行，确保格式整齐
				return;
			}
		}
	}
}