/******************
	ex47
	1427405017
	沈家赟
	2015/5/20
******************/
/*************************************************
4.12   请编写一个把一位十六进制数转换成对应字符ASCII码的子程序sub4，
	该子程序不能采用条件转移指令。
	编写一个程序ex47，演示调用该子程序sub4。

	充分利用字符串操作指令和重复前缀
**************************************************/
#include <stdio.h>

int main()
{
	int hex=0;
	char c;
	
	printf("嵌入汇编程序ex47\n");
	printf("请输入一位十六进制数：\n");
	scanf("%x",&hex);

	_asm{
		MOV EDX, hex;
		CALL sub4;		// 调用十六进制转换ASCII子程序sub4	
		MOV c, DL;
	}

	printf("转换成的ASCII字符为：%c\n",c);

	return 0;

//	子程序名（入口标号）：sub4
//	功能：把一位十六进制数转换成对应字符ASCII码的子程序sub4
//	入口参数：（1）存放十六进制数值的int型的通用寄存器EDX
//	出口参数：（1）存储转换ASCII结果的字节通用寄存器DL
//	其他说明：（1）此段函数会调用并影响ECX,EAX,EDX的值
//			  （2）该子程序不能采用条件转移指令！
	_asm{
sub4:
		BTS EDX, 4;
		BTS EDX, 5;

		CMP EDX, '9';
		SETA AL;	// 若输入的十六进制值EDX>9,则置EAX为1；否则EAX清零
		MOV CL, 7;	// 补差值7
		MUL CL;		// AX = AL*7
		ADD DL, AL;	// (0~9)+0; (A~F)+7

		RET;
	}
}